Examinator/src/Enums/ТипыПолейРегистрацииВебКабинетаСУО/ТипыПолейРегистрацииВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПолейРегистрацииВебКабинетаСУО</name>
  <enumValues>
    <name>ПолеВвода</name>
  </enumValues>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
  <enumValues>
    <name>Пароль</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыПолейРегистрацииВебКабинетаСУО/ManagerModule.bsl
Функция ЗначениеДляВебКабинета(ТипПоля) Экспорт
	
	Если ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода Тогда
		
		Возврат "text";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ЭлектроннаяПочта Тогда
		
		Возврат "email";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.Пароль Тогда
		
		Возврат "password";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.Число Тогда
		
		Возврат "number";
		
	КонецЕсли;
	
	Возврат "text";
		
КонецФункции
